app/Http/Controllers/Auth/LoginController.php

    public function handleProviderCallback()
    {
        $userFromFacebook = Socialite::driver('facebook')->user();

        $name = $userFromFacebook->getName();
        $email = $userFromFacebook->getEmail();


        $user = User::where(['email' => $email])->first();
---
select * from `users` where (`email` = 'vk202164356@gmail.com') limit 1