app/Http/Controllers/Tests/TestController.php

    public function index()
    {
        $tests = (Group::find(auth()->user()->group_id))->tests->pluck('id');

        $tests = Test::where('status', 'completed')
            ->whereIn('id', $tests)
            ->get();
---
select `tests`.*, `group_test`.`group_id` as `pivot_group_id`, `group_test`.`test_id` as `pivot_test_id` from `tests` inner join `group_test` on `tests`.`id` = `group_test`.`test_id` where `group_test`.`group_id` = 1
select * from `tests` where `status` = 'completed' and `id` in (1, 2, 3, 6, 7, 8)

    public function show(int $id)
    {
        if (DB::table('group_test')
            ->where([
            ['group_id', auth()->user()->group_id],
            ['test_id', $id]
        ])->exists()) {
---
select exists(select * from `group_test` where (`group_id` = 1 and `test_id` = 6)) as `exists`