app/Http/Controllers/Tests/TestController.php

  public function show($id)
  {
    $test = Test::select('id', 'name')->where([['id', $id], ['status', 'completed']])
      ->with('questions.answers:id,question_id,answer')
      ->with('questions.file:id,path')
      ->with('questions:id,test_id,file_id,question')
      ->firstOrFail();
---
select `id`, `path` from `files` where 0 = 1
select `id`, `name` from `tests` where (`id` = '15' and `status` = 'completed') limit 1
select `id`, `question_id`, `answer` from `answers` where `answers`.`question_id` in (5, 9, 10, 11, 26, 31, 37, 38)
select `id`, `test_id`, `question` from `questions` where `questions`.`test_id` in (15)