app/Http/Controllers/Dashboard/AccessToTests/AccessToTestsController.php

    public function index()
    {
        $groups = Group::all();
---
select * from `groups`

    public function create()
    {
        $groups = Group::all();
        $tests = Test::all();
---
select * from `groups`
select * from `tests`