app/Http/Controllers/Dashboard/Files/FileController.php

    public function index()
    {
        $files = File::orderBy('id', 'desc')->paginate(10);
---
select * from `files` order by `id` desc limit 10 offset 0
select count(*) as aggregate from `files`