app/Http/Controllers/Users/Results/ResultController.php

    public function index()
    {
        $user = User::select('name', 'id', 'group_id', 'role')
            ->where('id', auth()->user()->id)
            ->with(['tests.results' => function($q) {
                $q->where('group_id', auth()->user()->group_id)
                ->where('user_id', auth()->user()->id);
            }])
            ->with(['tests' => function($q) {
                $q->distinct('tests.id');
            }])
            ->first();
---
select * from `results` where `results`.`test_id` in (6) and `group_id` = 2 and `user_id` = 3
select `name`, `id`, `group_id`, `role` from `users` where `id` = 3 limit 1
select distinct `tests`.*, `results`.`user_id` as `pivot_user_id`, `results`.`test_id` as `pivot_test_id` from `tests` inner join `results` on `tests`.`id` = `results`.`test_id` where `results`.`user_id` in (3)