app/Models/Test.php

select `id`, `name` from `tests` where `id` = 15 limit 1
select `id`, `question_id`, `answer` from `answers` where `answers`.`question_id` in (62, 63, 64, 65, 66) and `status` = 'true'
select `id`, `test_id`, `question` from `questions` where `questions`.`test_id` in (15)
---
    public function checkResults(Request $request)
    {
        //get an array of answers
        $answers = json_decode($request->answers);

        $test_id = $request->id;

        $test = Test::select('id', 'name')
            ->where('id', $test_id)
            ->with(['questions.answers' => function ($q) {
                $q->select('id', 'question_id', 'answer')
                    ->where('status', 'true');
            }
            ])
            ->with('questions:id,test_id,question')
            ->first();