app/Models/Test.php

select `id`, `name` from `tests` where `id` = 6 limit 1
select `id`, `question_id`, `answer` from `answers` where `answers`.`question_id` in (17, 18, 19, 20) and `status` = 'true'
select `id`, `test_id`, `question` from `questions` where `questions`.`test_id` in (6)
---
    public function checkResults(CheckResultsRequest $request)
    {
        //get an array of answers
        $answers = $request->get('answers');

        $test_id = $request->get('id');

        $test = Test::select('id', 'name')
            ->where('id', $test_id)
            ->with(['questions.answers' => function ($q) {
                $q->select('id', 'question_id', 'answer')
                    ->where('status', 'true');
            }
            ])
            ->with('questions:id,test_id,question')
            ->firstOrFail();