app/Http/Controllers/Dashboard/DashboardController.php

  public function index()
  {
    $tests = Test::select('id', 'name', 'updated_at')
      ->with('questions.answers:id,question_id,answer,updated_at')
      ->with('questions:id,test_id,question,updated_at')
      ->orderBy('id', 'desc')
      ->paginate(5);
---
select `id`, `name`, `updated_at` from `tests` order by `id` desc limit 5 offset 0
select `id`, `question_id`, `answer`, `updated_at` from `answers` where `answers`.`question_id` in (1, 2, 3, 5, 7, 9, 10, 11, 14, 16, 19, 20, 21, 25, 26, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 42, 44, 46, 50)
select `id`, `test_id`, `question`, `updated_at` from `questions` where `questions`.`test_id` in (7, 11, 12, 14, 15)
select count(*) as aggregate from `tests`