app/Http/Controllers/Dashboard/Questions/QuestionController.php

update `questions` set `question` = 'Сколько мне лет? 20', `questions`.`updated_at` = '2020-06-03 14:54:19' where `id` = 29
delete from `questions` where `id` = 52
---
    public function update(UpdateRequest $request, Question $question)
    {
        $data = $request->only(['question']);


        if ($request->hasFile('image')) {
            $file = (new File)->storeFile($request);
            $data['file_id'] = $file->id;
        }

        $oldFile = $question->file_id;

        $question->update($data);

        if ($request->hasFile('image')) {
            $oldFile = File::find($oldFile);
            Storage::delete('/public/'.$oldFile->path);
            $oldFile->delete();