app/Http/Controllers/Dashboard/Results/ResultController.php

select `name`, `id`, `group_id`, `role` from `users` where `users`.`group_id` in (1, 2, 3, 4) order by `name` asc
select distinct `tests`.*, `results`.`user_id` as `pivot_user_id`, `results`.`test_id` as `pivot_test_id` from `tests` inner join `results` on `tests`.`id` = `results`.`test_id` where `results`.`user_id` in (1, 2)
select distinct `tests`.`name`, `tests`.`id` as `test_id`, `results`.*, `result_test_user`.`user_id` as `pivot_user_id`, `result_test_user`.`result_id` as `pivot_result_id` from `results` inner join `result_test_user` on `results`.`id` = `result_test_user`.`result_id` inner join `tests` on `result_test_user`.`test_id` = `tests`.`id` where `result_test_user`.`user_id` in (1, 2, 3)
---
    public function index()
    {
        $groups = Group::with('users.tests.results')
            ->with(['users.tests' => function($q) {
                $q->distinct();
            }])
            ->with(['users' => function($q) {
                $q->select('name', 'id', 'group_id', 'role')->orderBy('name');
            }])
            ->get();