app/Repositories/GroupRepository.php

    public function getGroups()
    {
        return Group::all();
---
select * from `groups`