app/Repositories/TestRepository.php

select `id`, `name`, `updated_at`, `status` from `tests` where `id` = 9 limit 1
select `id`, `path` from `files` where `files`.`id` in (25, 26)
select `id`, `question_id`, `answer`, `status`, `updated_at` from `answers` where `answers`.`question_id` in (29, 34)
select `id`, `test_id`, `file_id`, `question`, `updated_at` from `questions` where `questions`.`test_id` in (9)
---
    public function getTestForDashboard(int $id)
    {
        return Test::select('id', 'name', 'updated_at', 'status')
            ->where('id', $id)
            ->with('questions.answers:id,question_id,answer,status,updated_at')
            ->with('questions.file:id,path')
            ->with('questions:id,test_id,file_id,question,updated_at')
            ->firstOrFail();